In [1]:
import numbers as np
import pandas as pd

Re-indexing & Altering labels

In [2]:
data={
    'Name':['Alice','Bob','Charlie'],
    'Age':[25,30,35]
}

In [3]:
df=pd.DataFrame(data,index=['a','b','c'])
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [4]:
df.reindex(['c','a','b'])

      Name  Age
c  Charlie   35
a    Alice   25
b      Bob   30

In [5]:
df.reindex(['c','a','b','p'])

      Name   Age
c  Charlie  35.0
a    Alice  25.0
b      Bob  30.0
p      NaN   NaN

In [6]:
df.reindex(['p','q','r'])

  Name  Age
p  NaN  NaN
q  NaN  NaN
r  NaN  NaN

In [7]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [8]:
df.reindex(columns=["Age","Name"])

   Age     Name
a   25    Alice
b   30      Bob
c   35  Charlie

In [9]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

Rename index and columns

In [10]:
df.rename(index={'a':'A', 'p':'P', 'c':'C', 'q':'Q'},columns={'Name':'First Name','Age':"Current Age"})

  First Name  Current Age
A      Alice           25
b        Bob           30
C    Charlie           35

In [11]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [12]:
# Directly Replace Index or Column Labels

In [13]:
df.index=['x','y','z']
df.columns=['personName','personAge']

In [14]:
df

  personName  personAge
x      Alice         25
y        Bob         30
z    Charlie         35

In [15]:
print(df.index)

Index(['x', 'y', 'z'], dtype='object')

In [16]:
print(df.columns)

Index(['personName', 'personAge'], dtype='object')

In [17]:
df.reset_index(inplace=True)

In [18]:
df

  index personName  personAge
0     x      Alice         25
1     y        Bob         30
2     z    Charlie         35

In [19]:
df.drop(columns=['index'],inplace=True)

In [20]:
df

  personName  personAge
0      Alice         25
1        Bob         30
2    Charlie         35

Pivoting

In [21]:
data={
    "Date":["2024-01-01","2024-01-01","2024-01-02","2024-01-02"],
    "Product":["Laptop","Mouse","Laptop","Mouse"],
    "Sales":[1200,100,1300,120]
}
df=pd.DataFrame(data)

In [22]:
df.pivot(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [23]:
df.pivot(index="Product",columns="Date",values="Sales")

Date     2024-01-01  2024-01-02
Product
Laptop         1200        1300
Mouse           100         120

In [24]:
df.pivot(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [25]:
df.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="sum")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [26]:
data2={
    "Date":["2024-01-01","2024-01-01","2024-01-02","2024-01-02","2024-01-01","2024-01-02"],
    "Product":["Laptop","Mouse","Laptop","Mouse","Laptop","Mouse"],
    "Sales":[1200,100,1300,120,560,320],
}

df2=pd.DataFrame(data2)

In [27]:
df2

         Date Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120
4  2024-01-01  Laptop    560
5  2024-01-02   Mouse    320

In [28]:
df2.pivot_table(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2024-01-01   880.0  100.0
2024-01-02  1300.0  220.0

In [29]:
df2.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="mean")

Product     Laptop  Mouse
Date
2024-01-01   880.0  100.0
2024-01-02  1300.0  220.0

In [30]:
df2.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="sum")

Product     Laptop  Mouse
Date
2024-01-01    1760    100
2024-01-02    1300    440